Revit 2026 API

# IFCRange(IFCRange) Constructor

---

Instantiates an IFCRange object by copy.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IFCRange(
	IFCRange from
)
```
```vb
Public Sub New (
	from As IFCRange
)
```
```cpp
public:
IFCRange(
	IFCRange^ from
)
```
```fsharp
new :
        from : IFCRange -> IFCRange
```

#### Parameters

from IFCRange
     The IFCRange object.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

IFCRange Class

IFCRange Overload

Autodesk.Revit.DB.IFC Namespace